/* Alphabetic Presentation Form - unicode FB20-FB4F */
const code = {
    'ﬠ': 'ע',
    'ﬡ': 'א',
    'ﬢ': 'ד',
    'ﬣ': 'ה',
    'ﬤ': 'כ',
    'ﬥ': 'ל',
    'ﬦ': 'ם',
    'ﬧ': 'ר',
    'ﬨ': 'ת',
    // '﬩': '?',
    'שׁ': 'שׁ',
    'שׂ': 'שׂ',
    'שּׁ': 'שּׁ',
    'שּׂ': 'שּׂ',

    'אַ': 'אַ',
    'אָ': 'אָ',
    // 'אּ': 'אׅ',

    'בּ': '?',
    'גּ': '?',
    'דּ': '?',
    'הּ': '?',
    'וּ': '?',
    'זּ': '?',

    'טּ': '?',
    'יּ': '?',
    'ךּ': '?',
    'כּ': '?',
    'לּ': '?',

    'מּ': '?',


    'נּ': '?',
    'סּ': '?',

    'ףּ': '?',
    'פּ': '?',

    'צּ': '?',
    'קּ': '?',
    'רּ': '?',
    'שּ': '?',
    'תּ': '?',
    'וֹ': '?',
    'בֿ': '?',
    'כֿ': '?',
    'פֿ': '?',
    'ﭏ': '?'
}

const re = new RegExp(Object.keys(code).join("|"),"gi");

function normalize(str) {
    return str.replace(re, (i) => {
        return code[i] || i
    })
}

module.exports = normalize