const code = {

    /*
    '֑': '?',
    '֒': '?',
    '֓': '?',
    '֔': '?',
    '֕': '?',
    '֖': '?',
    '֗': '?',
    '֘': '?',
    '֙': '?',
    '֚': '?',
    '֛': '?',
    '֜': '?',
    '֝': '?',
    '֞': '?',
    '֟': '?',

    '֠': '?',
    '֡': '?',
    '֢': '?',
    '֣': '?',
    '֤': '?',
    '֥': '?',
    '֦': '?',
    '֧': '?',
    '֨': '?',
    '֩': '?',
    '֪': '?',
    '֫': '?',
    '֬': '?',
    '֭': '?',
    '֮': '?',
    '֯': '?',

    'ְ': '?',
    'ֱ': '?',
    'ֲ': '?',
    'ֳ': '?',
    'ִ': '?',
    'ֵ': '?',
    'ֶ': '?',
    'ַ': '?',
    'ָ': '?',
    'ֹ': '?',
    'ֺ': '?',
    'ֻ': '?',
    'ּ': '?',
    'ֽ': '?',
    '־': '?',
    'ֿ': '?',

    '׀': '?',
    'ׁ': '?',
    'ׂ': '?',
    '׃': '?',
    'ׄ': '?',
    'ׅ': '?',
    '׆': '?',
    'ׇ': '?',
    */

    // 1) Punctuation
    // '׆': '?', // nun hafukha


    // 2) Letter
    'א': '-', // alef

    'ב': 'w', // wet
    'בּ': 'b', // bet (dom)

    'ג': 'g', // gimel
    //'גּ': 'g',

    'ד': 'd', // dalet
    //'דּ': 'd',

    'ה': 'h', // he
    //'הּ': 'h',

    'ו': 'w', // waw
    //'וּ': 'w',

    'ז': 'z', // zajin
    //'זּ': 'z',

    'ח': 'ch', // chet

    'ט': 't', // tet
    //'טּ': 't',

    'י': 'j', // jud
    //'יּ': 'j',

    'כ': 'ch', // chaf
    'ך': 'ch', // chaf

    'כּ': 'k', // kaf
    //'ךּ': 'k',

    'ל': 'l', // lamed

    'מ': 'm', // mem
    'ם': 'm',
    //'מּ': 'm',

    'נ': 'n', // nun
    'ן': 'n',
    //'נּ': 'n',

    'ס': 's', // samech
    //'סּ': 's',

    'ע': '-', // ajin

    'פ': 'f', // fe
    'ף': 'f',

    'פּ': 'p', // pe
    //'ףּ': 'p',

    'צ': 'c', // cadi
    'ץ': 'c',

    //'צּ': 'c',
    //'קּ': 'c',

    'ק': 'k', // kof
    //'קּ': 'k',

    'ר': 'r', // resz
    //'רּ': 'r',

    'שׁ': 'sz', // szin
    //'שּׁ': 'sz',

    'שׂ': 's', // sin
    //'שּׂ': 's',

    'ש': 's',
    //'שּ': 's',

    'ת': 't', // taw
    //'תּ': 't',

    // 'ׯ': '?',

    // Ligature
    // 'װ': '?',
    // 'ױ': '?',
    // 'ײ': '?',
    // '׳': '?',
    // '״': '?'
}

const re = new RegExp(Object.keys(code).join("|"),"gi");

function transcript(str) {
    return str.replace(re, (i, index) => {
        return code[i] || i
    })
}
module.exports = transcript