const code = {

    // Accent
    /*
    '֑': '?',
    '֒': '?',
    '֓': '?',
    '֔': '?',
    '֕': '?',
    '֖': '?',
    '֗': '?',
    '֘': '?',
    '֙': '?',
    '֚': '?',
    '֛': '?',
    '֜': '?',
    '֝': '?',
    '֞': '?',
    '֟': '?',
    '֠': '?',
    '֡': '?',
    '֢': '?',
    '֣': '?',
    '֤': '?',
    '֥': '?',
    '֦': '?',
    '֧': '?',
    '֨': '?',
    '֩': '?',
    '֪': '?',
    '֫': '?',
    '֬': '?',
    '֭': '?',
    '֮': '?',
    */

    'ִי': 'i', // TODO

    //'֯': '?', // masora circle

    'ְ': 'e', // szwa (bardzo krótkie e)
    //'ֱ': '?', //segol
    //'ֲ': '?', //patah
    //'ֳ': '?', //qamats

    //'יִ': 'i', // hireq + jud
    'ִ': 'i', // hireq (i)
    'ֵ': 'e', // sere (długie e)
    'ֶ': 'e', // segol
    'ַ': 'a', // patah
    'ָ': 'a', // qames
    //'ֹ': '?',
    //'ֺ': '?',
    //'ֻ': '?',
    'ּ': '?', // dageh
    //'ֽ': '?',
    //'־': '?',
    //'ֿ': '?',
    //'׀': '?',
    'ׁ': '?',
    //'ׂ': '?',
    '׃': '.',
    //'ׄ': '?',
    //'ׅ': '?',
    //'׆': '?', // nun hafukha
    //'ׇ': '?',

    // Letter
    'א': '', // alef

    'בּ': 'b', // bet (dom)
    'בּ': 'b', // bet (dom)
    'ב': 'w', // wet

    'ג': 'g', // gimel
    //'גּ': 'g',

    'ד': 'd', // dalet
    //'דּ': 'd',

    'ה': 'h', // he
    //'הּ': 'h',

    'ו': 'w', // waw
    //'וּ': 'w',

    'ז': 'z', // zajin
    //'זּ': 'z',

    'ח': 'ch', // chet

    'ט': 't', // tet
    //'טּ': 't',

    'י': 'j', // jod
    //'יּ': 'j',

    'כ': 'ch', // chaf
    'ך': 'ch', // chaf

    'כּ': 'k', // kaf
    //'ךּ': 'k',

    'ל': 'l', // lamed

    'מ': 'm', // mem
    'ם': 'm',
    //'מּ': 'm',

    'נ': 'n', // nun
    'ן': 'n',
    //'נּ': 'n',

    'ס': 's', // samech
    //'סּ': 's',

    'ע': '-', // ajin

    'פ': 'f', // fe
    'ף': 'f',

    'פּ': 'p', // pe
    //'ףּ': 'p',

    'צ': 'c', // cade
    'ץ': 'c',

    //'צּ': 'c',
    //'קּ': 'c',

    'ק': 'q', // qof
    //'קּ': 'q',

    'ר': 'r', // resz
    //'רּ': 'r',

    //'שִׁי': 'szi', // TODO

    'שׁ': 'sz', // szin [05e9+05c1]
    'שׁ': 'sz', // szin
    //'שּׁ': 'sz',

    'שׂ': 's', // sin
    //'שּׂ': 's',

    'ש': 's',
    //'שּ': 's',

    'ת': 't', // taw
    //'תּ': 't',

    // 'ׯ': '?',

    // Ligature
    // 'װ': '?',
    // 'ױ': '?',
    // 'ײ': '?',
    // '׳': '?',
    // '״': '?'
}

const re = new RegExp(Object.keys(code).join("|"),"gi");

function transcript(str) {
    return str.replace(re, (i, index) => {
        // console.log(i, index)
        let value = code[i]
        if(value === '') return value
        return value || i
    })
}
module.exports = transcript